tap "anomalyco/tap"
tap "aquaproj/aqua"
tap "ariga/tap"
tap "atlassian/acli"
tap "bazelbuild/tap"
tap "bufbuild/buf"
tap "cue-lang/tap"
tap "datadog-labs/pack"
tap "datawire/blackbird"
tap "derailed/k9s"
tap "github/gh"
tap "go-delve/delve"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "kardolus/chatgpt-cli"
tap "kouzoh/tap"
tap "ktr0731/evans"
tap "reviewdog/tap"
tap "sourcegraph/src-cli"
tap "teamookla/speedtest"
tap "yt-dlp/taps"
# Declarative CLI Version manager
brew "aqua"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Rewrite bazel BUILD files using standard commands
brew "buildozer"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Core application library for C
brew "glib"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Utility for connecting securely to your Cloud SQL instances
brew "cloud-sql-proxy"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Functional programming language for building browser-based GUIs
brew "elm"
# CLI for templating and/or deploying FaaS functions
brew "faas-cli"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# New file format for still image compression
brew "jpeg-xl"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GitHub Model Context Protocol server for AI tools
brew "github-mcp-server"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go implementation of configuration language for defining JSON data
brew "go-jsonnet"
# Database migrations CLI tool
brew "golang-migrate"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Like cURL, but for gRPC
brew "grpcurl"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Convert HCL2 to JSON
brew "hcl2json"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Development kit for the Java programming language
brew "openjdk"
# Statically typed programming language for the JVM
brew "kotlin"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Install NodeJS versions
brew "node-build"
# Node.js version manager
brew "nodenv"
# Libraries for security-enabled client and server applications
brew "nss"
# Shell command parallelization utility
brew "parallel"
# AI agent toolkit
brew "pi-coding-agent"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@16", link: true
# Coreutils progress viewer
brew "progress"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Strongly typed programming language that compiles to JavaScript
brew "purescript"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Database of common MIME types
brew "shared-mime-info"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli", trusted: true
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf", trusted: true
# CUE is an open source data constraint language which aims to simplify tasks involving defining and using data.
brew "cue-lang/tap/cue", trusted: true
# Go-based command-line wrapper for easy interaction with Datadog APIs
brew "datadog-labs/pack/pup", trusted: true
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s", trusted: true
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# CLI for interacting with the OpenAI and Azure ChatGPT API
brew "kardolus/chatgpt-cli/chatgpt-cli", trusted: true
# A command line application to help you develop mercari/merpay microservices
brew "kouzoh/tap/merctl", trusted: true
# Evans: more expressive universal gRPC client
brew "ktr0731/evans/evans", trusted: true
# Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "reviewdog/tap/reviewdog", trusted: true
# Sourcegraph CLI
brew "sourcegraph/src-cli/src-cli", trusted: true
# Ookla Speedtest
brew "teamookla/speedtest/speedtest", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-hack"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# System monitoring app
cask "istat-menus@6"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Markdown editor
cask "markedit"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Colour picker for colours onscreen
cask "pika"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Native database client for many database types
cask "tablepro"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Multiplayer code editor
cask "zed"
