tap "aquaproj/aqua"
tap "ariga/tap"
tap "bazelbuild/tap"
tap "bufbuild/buf"
tap "cue-lang/tap"
tap "datawire/blackbird"
tap "derailed/k9s"
tap "github/gh"
tap "go-delve/delve"
tap "gromgit/fuse"
tap "kardolus/chatgpt-cli"
tap "ktr0731/evans"
tap "reviewdog/tap"
tap "teamookla/speedtest"
tap "yt-dlp/taps"
brew "xz"
brew "jpeg-xl"
brew "aqua"
brew "aria2"
brew "asciinema"
brew "bat"
brew "bazelisk"
brew "buildozer"
brew "caddy"
brew "glib"
brew "carthage"
brew "cryptography"
brew "certbot"
brew "clang-format"
brew "cloud-sql-proxy"
brew "deno"
brew "direnv"
brew "elm"
brew "faas-cli"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git-delta"
brew "github-mcp-server"
brew "gnupg"
brew "go"
brew "go-jsonnet"
brew "golang-migrate"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grpcurl"
brew "guile"
brew "haskell-stack"
brew "hcl2json"
brew "hub"
brew "hugo"
brew "shared-mime-info"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "k3d"
brew "kind"
brew "openjdk"
brew "kotlin"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "libdvdcss"
brew "node"
brew "marp-cli"
brew "mint"
brew "qt"
brew "mkvtoolnix"
brew "nmap"
brew "node-build"
brew "nodenv"
brew "nss"
brew "parallel"
brew "postgresql@14"
brew "progress"
brew "protobuf"
brew "protoc-gen-go"
brew "purescript"
brew "pwgen"
brew "pyenv"
brew "rclone"
brew "reattach-to-user-namespace"
brew "rename"
brew "streamlink"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bufbuild/buf/buf"
brew "derailed/k9s/k9s"
brew "kardolus/chatgpt-cli/chatgpt-cli"
brew "ktr0731/evans/evans"
brew "reviewdog/tap/reviewdog"
brew "teamookla/speedtest/speedtest"
cask "1password-cli"
cask "aws-vpn-client"
cask "beekeeper-studio"
cask "chatgpt"
cask "claude-code"
cask "cursor"
cask "docker-desktop"
cask "font-hack"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "keepingyouawake"
cask "macdown"
cask "mpv"
cask "ngrok"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "tailscale-app"
cask "vlc"
cask "xcodes-app"
