tap "ariga/tap"
tap "bazelbuild/tap"
tap "bufbuild/buf"
tap "cue-lang/tap"
tap "datawire/blackbird"
tap "github/gh"
tap "go-delve/delve"
tap "golang-migrate"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ktr0731/evans"
tap "reviewdog/tap"
tap "teamookla/speedtest"
tap "yt-dlp/taps"
brew "aria2"
brew "asciinema"
brew "bat"
brew "bazelisk"
brew "caddy"
brew "carthage"
brew "certbot"
brew "circleci"
brew "clang-format"
brew "cloud-sql-proxy"
brew "deno"
brew "direnv"
brew "doctl"
brew "elm"
brew "faas-cli"
brew "fasd"
brew "ffmpeg"
brew "gdk-pixbuf"
brew "gh"
brew "glib"
brew "gnupg"
brew "gnutls"
brew "go"
brew "go-jsonnet"
brew "graphviz"
brew "grpcurl"
brew "guile"
brew "harfbuzz"
brew "haskell-stack"
brew "helm"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "k3d"
brew "kotlin"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "libdvdcss"
brew "librsvg"
brew "marp-cli"
brew "mint"
brew "mkvtoolnix"
brew "nmap"
brew "node"
brew "node-build"
brew "nodenv"
brew "nss"
brew "pango"
brew "progress"
brew "protobuf"
brew "purescript"
brew "pwgen"
brew "pyenv"
brew "qt"
brew "rclone"
brew "rename"
brew "reattach-to-user-namespace"
brew "shared-mime-info"
brew "streamlink"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "traefik"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "xz"
brew "youtube-dl"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bufbuild/buf/buf"
brew "cue-lang/tap/cue"
brew "datawire/blackbird/telepresence"
brew "ktr0731/evans/evans"
brew "reviewdog/tap/reviewdog"
brew "teamookla/speedtest/speedtest"
brew "yt-dlp/taps/yt-dlp"
cask "audacity"
cask "beekeeper-studio"
cask "bloomrpc"
cask "kap"
cask "macdown"
cask "macfuse"
cask "magicavoxel"
cask "megacmd"
cask "mpv"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "sequel-pro"
cask "transmission"
cask "tunnelblick"
cask "vlc"
